#### Importing necessary libraries

In [1]:
import pandas as pd
import os

#### Creating data for a DataFrame

In [2]:
data = {
    'name': ['John Reese', 'Harold Finch', 'Jocelyn Carter', 'Lionel Fusco', 'Sameen Shaw', 'Samantha Groves', 'Nathan Ingram', 'Jason Greenfield', 'Zoe Morgan', 'Caleb Phipps'],
    'age': [42, 60, 38, 44, 25, 27, 50, 32, 41, 30],
    'city_department_id': [101010, 202020, 303030, 404040, 505050, 606060, 202020, 303030, 101010, 505050],
    
}

#### Assigning data to a DataFrame

In [3]:
df = pd.DataFrame(data)

In [4]:
df

               name  age  city_department_id
0        John Reese   42              101010
1      Harold Finch   60              202020
2    Jocelyn Carter   38              303030
3      Lionel Fusco   44              404040
4       Sameen Shaw   25              505050
5   Samantha Groves   27              606060
6     Nathan Ingram   50              202020
7  Jason Greenfield   32              303030
8        Zoe Morgan   41              101010
9      Caleb Phipps   30              505050

#### Creating values for a future column

In [5]:
badge_numbers = list(range(100, 110))

#### Inserting a column into a DataFrame

In [6]:
df.insert(0, 'badge_number', badge_numbers)

In [7]:
df

   badge_number              name  age  city_department_id
0           100        John Reese   42              101010
1           101      Harold Finch   60              202020
2           102    Jocelyn Carter   38              303030
3           103      Lionel Fusco   44              404040
4           104       Sameen Shaw   25              505050
5           105   Samantha Groves   27              606060
6           106     Nathan Ingram   50              202020
7           107  Jason Greenfield   32              303030
8           108        Zoe Morgan   41              101010
9           109      Caleb Phipps   30              505050

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

#### Setting index and exporting DataFrame as a CSV file

#### Setting badge_number column as DataFrame index

In [8]:
df.set_index('badge_number')

                          name  age  city_department_id
badge_number
100                 John Reese   42              101010
101               Harold Finch   60              202020
102             Jocelyn Carter   38              303030
103               Lionel Fusco   44              404040
104                Sameen Shaw   25              505050
105            Samantha Groves   27              606060
106              Nathan Ingram   50              202020
107           Jason Greenfield   32              303030
108                 Zoe Morgan   41              101010
109               Caleb Phipps   30              505050

In [9]:
# Specify the relative path to save the cleaned DataFrame
relative_path_save = os.path.join('..','exported cleaned csv files', 'officers_data.csv')

# Construct the absolute path to save the cleaned file
absolute_path_save = os.path.abspath(relative_path_save)

# Save the cleaned DataFrame to a CSV file
df.to_csv(absolute_path_save, index=False)